// Потому что рекурсия сначала уходит вглубь, а потом возвращается назад.
function printNumbers(n) {
	// БАЗОВЫЙ СЛУЧАЙ
	if (n === 0) {
		return;
	}

	// РЕКУРСИВНЫЙ ВЫЗОВ
	printNumbers(n - 1);

	// ВЫВОД ПОСЛЕ ВОЗВРАТА
	console.log(n);
}

printNumbers(5); // 1 2 3 4 5
// 🔄 Как выполняется (по шагам)
// printNumbers(5)
//  → printNumbers(4)
//    → printNumbers(3)
//      → printNumbers(2)
//        → printNumbers(1)
//          → printNumbers(0) ❌ стоп

// обратный отсчёт от n до 1
function countdown(n) {
	if (n === 0) {
		console.log('Готово');
		return;
	}
	console.log(n);
	countdown(n - 1);
}

countdown(5); // 5 4 3 2 1 Готово

// факториал числа 5! = 5 × 4 × 3 × 2 × 1
// логика - Каждый факториал — это:
// n! = n × (n - 1)!
function factorial(n) {
	if (n === 1 || n === 0) {
		return 1;
	}
	return n * factorial(n - 1);
}
console.log(factorial(5)); // 120

// start: factorial(5)

// 5 * factorial(4)
//   4 * factorial(3)
//     3 * factorial(2)
//       2 * factorial(1)
//         factorial(1) → returns 1

// возвращаем:
//       2 × 1 = 2
//     3 × 2 = 6
//   4 × 6 = 24
// 5 × 24 = 120

// числа Фибоначчи
// последовательность - 0, 1, 1, 2, 3, 5, 8, 13...
// Каждое число = сумма двух предыдущих
// формула - fib(n) = fib(n - 1) + fib(n - 2)
function fibonacci(n) {
	if (n === 0) return 0;
	if (n === 1) return 1;

	return fibonacci(n - 1) + fibonacci(n - 2);
}
console.log(fibonacci(6)); // 8
console.log(fibonacci(10)); // 55

/**
Этот вариант медленный, потому что:
одни и те же значения считаются много раз
fib(10) вызывает fib(9) и fib(8)
fib(9) вызывает fib(8) снова 😵
👉 Это нормально для обучения, но в реальных проектах используют:
мемоизацию
или цикл
 */
