// Замыкание — это функция, которая "запоминает" Лексическое окружение, в котором она была создана, даже если это окружение уже завершило выполнение.

// Лексическое окружение - невидимый объект который есть у любого блока, скрипта или функции

// Когда ты создаёшь функцию внутри другой функции, внутренняя функция может использовать переменные внешней функции даже после того, как внешняя функция уже закончила свою работу.

function makeCounter(start) {
	let count = start;
	return function () {
		return count++;
	};
}

const counter = makeCounter(10);
console.log(counter()); // 10
console.log(counter()); // 11
console.log(counter()); // 12

// Где это полезно?
// * Счётчики, приватные данные (инкапсуляция), функции с памятью о предыдущих вызовах.
// * В колбэках, асинхронных операциях, обработчиках событий.

// Замыкание — это как если бы ты уволился с работы, но забрал с собой ключи от офиса. Теперь можешь зайти туда в любое время, хотя официально тебя уже нет в компании.

//Задача
function createIncrement() {
	let count = 0; // начальное значение счётчика
	function increment() {
		count++; // увеличиваем count на 1
	}

	let message = `Count is ${count}`; // создаём строку message на основе текущего count
	// Переменная "запоминает" текущее значение в момент создания.
	// Шаблонная строка не обновляется сама.
	//  🎮 Аналогия - Представь, что:
	//  count — это число на табло, которое может меняться.
	//  message — фотография этого табло.
	//  Когда ты создаёшь message, ты делаешь фотографию в этот момент, когда на табло было 0.
	//  Потом табло (count) меняется — 1, 2, 3…
	//  Но фотография остаётся старой — на ней всё ещё “0”.
	//  log() просто печатает эту старую фотографию.

	function log() {
		console.log(message); // выводим message в консоль
	}

	return [increment, log]; // возвращаем две функции
}

const [increment, log] = createIncrement(); // получаем две функции (деструктуризация массива)
/**
В реальной жизни аналогия:
Представь, что тебе на почте выдали коробку с двумя предметами:
Первый — ручка
Второй — карандаш
Ты сразу достаёшь ручку в одну руку, карандаш — в другую.
Вот это и есть деструктуризация: сразу "раскладываешь" содержимое коробки по местам.
 */

increment(); // увеличиваем count на 1 (count = 1)
increment(); // увеличиваем count на 1 (count = 2)
increment(); // увеличиваем count на 1 (count = 3)

log(); // Что выведется в консоль?

//  Как изменить код для актуального значения?
// Поместить message в функцию log()
function log() {
	let message = `Count is ${count}`; // теперь строка создаётся при каждом вызове log!
	console.log(message);
}

function makeCounter(count) {
	return function () {
		// return ++count; // увеличиваем и возвращаем
		return count++; //  возвращаем сначала 0 и затем увеличиваем переменную
	};
}

let counter1 = makeCounter(0);
let counter2 = makeCounter(0);

console.log(counter1());
console.log(counter1());

console.log(counter2());
console.log(counter2());

// 1
const createCounter = () => {
	let counter = 0;
	return () => {
		return counter++;
	};
};

const counter11 = createCounter();
const counter22 = createCounter();

console.log(counter11());
console.log(counter11());
console.log(counter11());
console.log(counter22());

// 2
const createToggler = () => {
	let toggler = false;
	return () => {
		toggler = !toggler;
		return toggler;
	};
};

const toggler1 = createToggler();
const toggler2 = createToggler();

console.log(toggler1());
console.log(toggler1());
console.log(toggler1());
console.log(toggler2());
console.log(toggler2());

// 3 валидация
const createValidator = regExp => {
	return value => {
		return regExp.test(value);
	};
};

const nameValidator = createValidator(/\w+/gi);
const phoneValidator = createValidator(/\d+/gi);
const cardValidator = createValidator(/\d{4}\s\d{4}\s\d{4}\s\d{4}/gi);

console.log(nameValidator('Vlad'));
console.log(nameValidator('1234'));

console.log(phoneValidator('Vlad'));
console.log(phoneValidator('1234'));

console.log(cardValidator('1111 2222 3333 4444'));
console.log(cardValidator('1111 2222 3 333 4444'));

// 4
const createEncoder = number => {
	return value => {
		return value
			.split('')
			.map(symbol => {
				return String.fromCharCode(symbol.charCodeAt(0) * number);
			})
			.join('');
	};
};

const encoder1 = createEncoder(7);
const encoder2 = createEncoder(9);

console.log(encoder1('Vlad'));
console.log(encoder2('1234'));
