/**
 * Это одна из ключевых тем во фронтенде, потому что она встречается:
   в React
   в работе с API
   при передаче аргументов
   при копировании данных
   при объединении объектов
   при фильтрации и преобразовании массивов
 */

// spread
const copy = [...arr]; // раскрываем

// rest
const [ab, ...rest] = arr; // собираем остаток

/** Задача 1: Поменять местами значения a и b */
let a = 5;
let b = 10;

// Создаём справа массив [b, a] → [10, 5]
// Слева деструктурируем: a получит первый элемент, b — второй
[a, b] = [b, a];

console.log(a); // 10
console.log(b); // 5

/** Задача 2: Вернуть несколько значений из функции */
// Напиши функцию, которая возвращает массив из трёх чисел.
// Используя деструктуризацию, присвой эти числа переменным num1, num2, num3.
function getNumbers() {
	// просто возвращаем массив из трёх чисел
	return [1, 2, 3];
}

// Достаём из массива три значения по порядку
const [num1, num2, num3] = getNumbers();

console.log(num1); // 1
console.log(num2); // 2
console.log(num3); // 3
// 💡 При вызове getNumbers() мы получаем массив [1, 2, 3],
// а запись const [num1, num2, num3] = ... распределяет эти значения по переменным.

/** Задача 3: Дефолтные (значения по умолчанию) */
// В массиве может быть меньше элементов, чем переменных.
// Используя деструктуризацию, задай значения по умолчанию.
let arr = [7];

// a берёт 7 из массива
// b и c не получают значения из массива, поэтому берут свои дефолты
const [aс = 1, bс = 2, c = 3] = arr;

console.log(aс); // 7 (из массива)
console.log(bс); // 2 (значение по умолчанию)
console.log(c); // 3 (значение по умолчанию)

/** Задача 4: Деструктуризация вложенных массивов */
const matrix = [
	[1, 2, 3],
	[4, 5, 6],
	[7, 8, 9],
];

// Первый элемент игнорируем, достаем второй массив
// Внутри второго массива пропускаем 4, берём 5
const [, [, element]] = matrix;

console.log(element); // 5
/**
 matrix = [
  [1, 2, 3],   // index 0
  [4, 5, 6],   // index 1 ← этот нужен
  [7, 8, 9]
]

[   ,    [  , element ]   ]
   ↑         ↑    ↑
пропускаем   4    5 — его берём

 */

/** Задача 5: Достань значения из объекта */
const person = {
	name: 'Alice',
	age: 25,
	job: 'Engineer',
};

const { name, age, job } = person; // имя переменной должно совпадать с ключом объекта

console.log(name); // 'Alice'
console.log(age); // 25
console.log(job); // 'Engineer'

/** Задача 6: Переименование переменных */
const book = {
	title: 'JavaScript Essentials',
	author: 'John Doe',
	year: 2021,
};

const { title: bookTitle, author: bookAuthor } = book;
// title      — откуда брать
// bookTitle  — как назвать переменную

console.log(bookTitle); // 'JavaScript Essentials'
console.log(bookAuthor); // 'John Doe'

/** Задача 7: Значения по умолчанию в объектах */
const user = {
	name: 'Bob',
};

const { nameU, ageU = 30 } = user;

console.log(name); // 'Bob'
console.log(age); // 30

/** Задача 8: Деструктуризация вложенных объектов */
const employee = {
	id: 101,
	info: {
		name: 'Jane',
		department: 'Marketing',
	},
};

const {
	info: { nameS, department },
} = employee;

console.log(name); // 'Jane
console.log(department); // 'Marketing'

/** Задача 9: Rest с массивами */
const [first, ...restNumbers] = numbers; // Rest всегда должен быть последним элементом.

console.log(first); // 1
console.log(restNumbers); // [2, 3, 4, 5]

/** Задача 10: Rest в объектах */
const product = {
	name: 'Laptop',
	price: 1000,
	brand: 'BrandName',
	stock: 50,
};

const { nameA, ...restt } = product;

console.log(name); // 'Laptop'
console.log(rest);
// { price: 1000, brand: 'BrandName', stock: 50 }

/** Задача 11: Spread для объединения массивов */
const arr1 = [1, 2, 3];
const arr2 = [4, 5, 6];

const mergedArray = [...arr1, ...arr2];

console.log(mergedArray); // [1, 2, 3, 4, 5, 6]

/** Задача 12: Spread для копирования объекта */
const car = {
	brand: 'Toyota',
	model: 'Corolla',
	year: 2020,
};

const newCar = { ...car, year: 2022 };
// Если указываем свойство после spread → оно перезаписывает значение.

console.log(newCar); // { brand: 'Toyota', model: 'Corolla', year: 2022 }

/** Задача 13: Spread и вложенные объекты */
const user9 = {
	id: 1,
	profile: {
		name: 'Anna',
		email: 'anna@example.com',
	},
};

/**
 * Нужно:
 * создать копию объекта
 * обновить email
 * при этом исходный объект НЕ должен измениться */

const updatedUser = {
	...user, // копируем сам объект
	profile: {
		// его вложенный объект profile
		email: 'new.email@example.com', // и только потом меняем email
	},
};

console.log(updatedUser);

/** Задача 14: Деструктуризация параметров функции */
const user8 = {
	name: 'John',
	age: 28,
	country: 'USA',
};

function displayUserInfo({ name, age }) {
	console.log(`Имя: ${name}, Возраст: ${age}`);
}

displayUserInfo(user);
